Repository: jouissancetka/LMW
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 花姑三人走后，两人没有直接回中天。
en_us: After Hua Gu and co left, the two of them didn't immediately return to ZhongTian.

source: 花姑三人以为她死了，所以没有绑住她的手。
en_us: Hua Gu and the two men had thought that she was already dead so they did not tie her hands up.

source: 花姑抢过男子的匕首，一丝停顿都没有就捅进游咏的心脏，她的动作就像她眼中的杀意一样果断。
en_us: Hua Gu snatched the man's dagger and did not even hesitate before plunging it into You Yong's heart. Her actions were as decisive as the killing intent in her eyes.

source: 花姑拔出匕首，紧皱着眉头却没有松开，反而警惕的看着四周，随后在同伴惊愕的目光下冲着四周拱手恭敬的说道：“不知是哪位前辈出手相助，可否现身一见？”
en_us: Hua Gu pulled out the dagger. Yet, she did not loosen her grip as she frowned but vigilantly watched her surroundings instead. Under the stunned gazes of her companions, she soon started rushing all around while cupping her hands in obeisance and respectfully addressed, "Though I do not know which senior has lent their assistance, would it be possible to show yourself to us?"

source: 花姑激动的看着凌霄，若她没猜错的话，出手的应该是这个男人，能使空间符失效，修为绝对在神境之上。
en_us: Hua Gu emotionally looked at Ling Xiao. If she did not make the wrong guess, the one who made the move should be this man. His cultivation base was definitely above the Divine Realm in order for him to cause the teleportation talisman to fail.

source: 花姑熟稔的语气仿佛和天元已经相处了几百年一样，没有半点扭捏，半颗心几乎偏向天狗了。
en_us: Hua Gu's casual tone made it seem as if she had known Tian Yuan for hundreds of years. Her entire heart had turned to TianGou without any uncertainty.

source: 花姑看着满脸阴狠怨毒的游咏，神色慢慢平静了下来。
en_us: Hua Gu gradually calmed down as she looked at You Yong, who had a face full of malice and rancor.

source: 花姑自信的道：“花姑是从她的话判断出来的，若她真是赤血家族的九小姐，身上应该不缺空间符，由圣境强者炼制的空间符怎么可能会失效，除非有外来因素，所以花姑斗胆猜测这里除我们还有其他人。”
en_us: Hua Gu confidently replied, "Hua Gu had determined this from You Yong's words. If she was really the Ninth Young Lady of the Vermilion Blood Clan, she should be carrying a teleportation talisman. It is impossible for the teleportation talisman refined by Sacred Realm expert to fail unless there are external factors. Thus, Hua Gu made a bold guess that there were other people too."

source: 花姑说：“那就离开星罗城，通天大陆之大，老娘就不信没有一处容身之地，更不信赤血家族能只手遮天。”
en_us: Hua Gu replied, "Then we'll just leave Xing Luo City. The TongTian Continent is so vast. This old woman (老娘) does not believe that there is no place for us to live and has even more doubts the Vermilion Blood Clan is an absolute monarch (只手遮天)."

source: 花雕接过玉简，然后郑重的收起来。
en_us: Hua Diao accepted the jade drive and solemnly put it away.

source: 苍盟办事的效率很快，没过多久就查到有两个形迹诡异的在宴会结束前不久离开了绵绵山，但因为上下的人太多，所以找不到他们了。
en_us: The Cang Alliance was as efficient as ever. It wasn't long before it was found that two suspicious people left Amaranthine Mountain not long after the end of of the celebration. However, because so many people left the mountain, so they couldn't find the two anymore.

source: 苍盟古往今来都是作为一个中立势力存在的。
en_us: The Cang Alliance had always been a neutral party.

source: 苍盟和赤血家族鼎立于南陆，两个势力明争暗斗那么udo年，到现在仍然谁也奈何不了谁，若傅苍穹站在他们这边，游震天想对他们下手就必须过傅苍穹这一关，这么结实的保护伞不好好利用怎么行！
en_us: The Cang Alliance and ChiXue Clan were at the top of the South Continent. After fighting behind the scenes for all those years, neither had managed to subdue the other. If Fu CangQiong stood on their side, You ZhenTian would have to go through Fu CangQiong to get to them. They had to use this shield well!

source: 苏朗一愣，听他说得这么信誓旦旦却仍然不大相信，只以为他是在糊弄自己，旋即冷笑的勾起嘴角，“那你倒是说说，比我更适合当第一天才的人是谁？”
en_us: Su Lang was stunned, but he still didn't believe it despite Yan Hui declaring it so solemnly. He just thought Yan Hui was fooling him and immediately sneered, "Why don't you say who is the one who is more worthy of being the Number One Genius than I am?

source: 苏朗一时打不出来了。
en_us: Su Lang was unable to answer.

source: 苏朗不甘心，不用大师兄说他也一定会查的。
en_us: Su Lang was disgruntled. Even without da-shixiong saying so, he would've gone to check for sure.

source: 苏朗之所以能够能够得到师傅的重视，和他从小就有用不完的材料绝对是分不开的，否则他也不可能晋级如此之快，最后被师傅看中并收为徒。
en_us: The reason why Su Lang was able to get the attention of their master was closely related to the fact that he had an infinite supply of materials when he was young. Otherwise, it was impossible for him to have advanced so quickly. In the end, he caught Shifu's eye and was then accepted as a disciple.

source: 苏朗却不吃他这一套，“我看你根本就是在羡慕嫉妒我这个天才，因为你当年晋级彩级一品的时候已经快七十岁，现在快一百岁了，好像也不过是二品修为，用不了多久我就会追上你，所以你在害怕，我说的对不对？”
en_us: Su Lang didn't take the bait. "From what I see, you're just jealous and envious of my natural talent, because when you advanced to the Grade One Rainbow Level, you were already almost seventy years old. Now you're nearly 100 years old, and yet you're only Grade Two Rainbow Level. I'll catch up to you before much longer, so you're afraid now. Aren't I correct?"

source: 苏朗原本气得快说不出话，突然就笑了起来。
en_us: Su Lang, who was originally too angry to speak, suddenly laughed.

source: 苏朗双手叉腰，“因为那是我准备送给师傅的。”
en_us: Su Lang placed his hands on his waist. "Because I'm preparing to give it to shifu."

source: 苏朗嗤笑道：“差点被你骗到了，编个谎话也不知道编得像样一点，就算是天才也不可能在短短几年内就晋级，我想你自己也体会过，彩级丹师岂是那么好晋级的，别说两品，就是一品都未必可能。”
en_us: Su Lang sneered, "I was almost deceived by you. You also have to do it decently if you want to fabricate a lie. It's impossible for him to advance in just a few years even if he is a genius. I believe that you have also experienced this. How can it be that easy for Rainbow Level mages to advance? Don't even speak of Grade Two, even advancing Grade One is not necessarily possible."

source: 苏朗在住处摔了十几套茶具，最后他决定引蛇出洞，就是帮他们找黑莲草，然后让李管事去通知他们。
en_us: Su Lang smashed more than a dozen tea sets in his residence and finally decided to pull a snake from its hole, that is, to help them find the Black Lotus Herb and then ask Steward Li to inform them.

source: 苏朗往窗外一看，在灵草堂右手边缓缓走来的人补正是他在找的两个人，刚说着他们就来了。
en_us: Su Lang looked out of the window. Weren't those two walking over slowly from the right the exact same people they had been looking for? They had just been talking about them, too.

source: 苏朗摇摇头，“那个李管事根本不敢告诉我，不过我猜能够让李管事点头答应，那个人应该下了血本，乌山集镇能买得起这么贵的灵草没几个人，所以我猜想他很可能不是这里的人。”
en_us: Su Lang shook his head. "That Manager Li wouldn't even dare to tell me. But I'm guessing that in order to make Manager Li nod his head and agree, that person must have invested some capital. There's only a few people in WuShan Town who can buy such an expensive magic herb, so I'm guessing that he most likely isn't from here."

source: 苏朗是个好动之人，仅一个晚上他就受不了了，从早到晚都跟他大师兄闹，因为有禁制，而进出的令牌被他大师兄拿走了。
en_us: Su Lang was someone who liked to have fun, and so he couldn't bear it anymore after just one night, fussing from morning to night with his dashixiong. Because there were restriction seals, his passage token (进出的令牌) was taken away by his dashixiong.

source: 苏朗毕竟是他介绍去顶级区的，结果李管事竟然把苏朗预定的灵草高价卖给另一个人，这不是在打他的面子么。
en_us: After all, he was the one who introduced Su Lang to the pinnacle section, but then Manager Li went and sold the magic herb that Su Lang had preordered to someone else for a high price. Wasn't that just slapping his face?

source: 苏朗的大师兄坐在窗边，从他的角落可以清清楚楚的看到灵草堂大门口的情况，每一个进进出出的人都能看到。
en_us: Su Lang's Eldest Martial brother sat by the window. From this corner, they could easily see the entrance of the Magic Herb Shop and everyone who entered and exited.

source: 苏朗眼睛几乎要脱框了。
en_us: Su Lan's eyes almost popped out of his skull.

source: 苏朗立刻被他激怒了，眼睛喷火，一糊涂就抓起他的衣领，愤怒地道：“你胡说，那你倒是说说，我哪里名不副实了？”
en_us: Su Lang was immediately enraged by his words. Flames shot from his eyes as he grabbed Yan Hui's collar in a fit of discombobulation and snarled, "You're talking nonsense! Then you tell me, how am I unworthy?!"

source: 苏朗脸色一下子难看了许多。
en_us: Su Lang's expression twisted uglily.

source: 苏朗被他反将一军，心里很不高兴，一拍桌子：“要不是你突然硬把我拉走，谁输谁赢还不一定。”
en_us: Su Lang's momentum was derailed by him, and he was very unhappy. He slapped the table. "If it weren't for you suddenly forcibly dragging me back, it's still uncertain who would've won or lost."

source: 苏朗说出这些话的时候，颜辉表情扭曲了一下。
en_us: Yan Hui's expression twisted for a moment when Su Lang said those words.

source: 若不是因为时间太过久远，这件事早就被人挖出来了。
en_us: If only it wasn't because it had happened so long ago, this matter would've long since been unearthed by someone.

source: 若不是游小默被困在宫殿里，再次进入空间只怕是几天后或者一个多月后，想想他就觉得一阵后怕。
en_us: If it weren't for You XiaoMo being trapped in the palace, the next time he would have entered his dimension might have been a few days later or an entire month later. Just thinking about it gave him a sense of lingering fear.

source: 若不是要进去只有破除结界这一招，他们其实也不想这样做，宫殿跌落海底，里面的宝贝也不知道能不能见水，找起来也颇为麻烦。
en_us: If it wasn't for the fact that they had to break the barrier to get inside, they honestly wouldn't want to do this. The water might not be good for the treasures inside and trying to find anything would become extremely troublesome.

source: 若少主真的有神境七星巅峰的修为，在天狗绝对排得进前五，所以天明和天恨几人可能要吃苦头了。
en_us: If Young Master was truly a Divine seven-star pinnacle practitioner, he would definitely place among the top five at Tengu, so Tian Ming, Tian Hen, and the rest would definitely suffer.

source: 若是在双鱼酒楼自然不需要担心有人敢来找麻烦，但双鱼酒楼不在逍遥院附近，当初为了方便，游小默特意挑了这家酒楼。
en_us: If they were at the ShuangYu Hotel, he naturally wouldn't be worried, but since the hotel wasn't close to the XiaoYao Institution, he choose this one out of convience.

source: 若是水元素之心藏在凌霄的空间或许会比较麻烦，但是他的空间却相当于他身体里的一部分，空间里多了什么少了什么，他只需要搜索一下就清楚了。
en_us: If the Water Elemental Essence was hidden in Ling Xiao's dimension, it might be a little more troublesome. But You XiaoMo's dimension was essentially a part of his body, and he only needed to do a quick check to know what there was in his dimension.

source: 若是能得到散发此气息的东西，修为必定能涨幅不少。
en_us: If they could obtain the thing that was emitting this scent, their cultivation bases would definitely be able to grow quite a bit.

source: 若是运气好，很可能扩展经脉，修炼将事半功倍，极其难得，等于生命有了转机，所以才叫转生丹。
en_us: If their luck was good, it was even possible for them to widen their meridians. They would be able to get twice the result with half the effort during cultivation. It was extremely rare and was tantamount to life taking a favorable turn, thus it was called the Reincarnation Pill.

source: 若是院生身上有这些东西就可以上前与他们进行交涉，价格自然好商量。
en_us: If the students had these items on them, they could immediately go up and start negotiations, and the prices were naturally easy to settle.

source: 若游家真如他猜测的那样，那么游家背后一定有他不知道的秘密，游小默觉得他上辈子活了十八年，竟然到死都没发现这个秘密。
en_us: There must be some secret hidden by the You family that he was unaware of if the You family's circumstances were really as he had suspected. You XiaoMo felt that he did not even discover this secret even after his death despite living there for eighteen years.

source: 若真是这样，再加一个他们恐怕也只能战成平手。
en_us: It this was true, perhaps they may only be able to bring the fight to a standstill even with the help of one more member.

source: 茶寮的老板愉快的给他们上了一壶热茶，游小默倒了一杯茶，端起来走到门口递给边上一名假装看来看去的年轻人，笑眯眯的说道：“你一路跟着我们辛苦你了，我请你喝杯茶！”
en_us: The shopkeeper of the teahouse happily served them a pot of hot tea. You XiaoMo poured a cup of tea before picking it up and walking to the door. He handed it to a young man who was pretending to look around, and he said with a smile, "It must've been hard work to follow us this whole time. I invite you to drink a cup of tea!"

source: 荒蛮位面的事情必须保密，这是凌霄跟他说的，因为一旦传出去，对他们有意图的人将会从赤血家族扩展到通天大陆所有势力。
en_us: Ling Xiao told him that the thing that happened at the (荒蛮位面) must be kept a secret. If it was to get out, then those looking for them would expand from the Vermillion Blood Clan to all of the TongTian Continent.

source: 莫名的话却让人感觉到白衣帅哥好像知道他们的秘密一样。
en_us: The inexplicable statement made them feel as if the handsome white-robed guy knew their secret.

source: 莫景从树上跳下来，刚好落在游小默身边，他亲眼看到凌霄如何杀死刑七并将他的内丹挖出来，内心并不平静，他或许应该庆幸自己不是刑七，并且有玄龟族这一层关系在，否则被挖内丹的很可能就是他。
en_us: Mo Jing jumped down from the tree, concidently he landed just beside You XiaoMo. He saw with his own two eyes, how Ling Xiao killed Xing Qi and took out his (内丹). His heart was in turmoil, maybe he should be happy that he wasn't Xing Qi and had a relation with the Black Turtle Clan, otherwise, the one who got their (内丹) stolened would likely be him.

source: 莫景其实并不想与刑七死杠上，他的内伤还没好，虽说刑七断了一只手臂，但是等高殷和黑熊赶过来，他就成了瓮中之鳖。
en_us: Mo Jing didn't actually want to fight (死杠) Xing Qi, since his internal wounds were not yet healed (内伤). Although, Xing Qi had lost his arm, if Gao Yan and Hei Xiong caught up, he would be a rat in a hole. (瓮中之鳖)

source: 莫景再孤陋寡闻也听说过逍遥院，再联想到少年介绍男人时说的那句话，看来这个叫凌默的男人应该很有名，总算稍微放心了。
en_us: No matter how ignorant Mo Jing was, he had still heard of XiaoYao Institution before. He thought back to what the youth had said when he introduced the man. It seemed that this man called Ling Mo should be very famous, and at last his mind was set a bit at ease.

source: 莫景则是一喜，他没想到还真有人在这里，事实上他喊那句话的时候确实是想引开邢七和他的同伴的注意力，好趁机逃跑，至于会不会有人回应他，他并没有抱太大的希望，不想竟然真的有人在。
en_us: Mo Jing however, was pleased, he didn't think someone would actually be there. In actuality, when he shouted that, he was hoping to divert the attention of Xing Qi and his friends, so that he would have a better chance of escaping. In terms of getting a response, he wasn't hopeful, but to think there was actually someoen there.

source: 莫景只告诉他们在自然城，至少接洽的地点和时间却没有告诉他们，只是让玄明传达说等他们进城后，他自己会立刻来找他们。
en_us: Mo Jing had only told them that he was at ZiRan City, and he had not told them basic information like the time and place to meet. He just let Xuan Ming tell them that he would come to them immediately after they entered the city.

source: 莫景咳了一声，从怀里拿出一个储物袋扔给他，“里面的灵草不多，是我目前能搜集到的，按照你说的，有种子，有幼苗，也有成熟的，不过成熟的最少。”
en_us: Mo Jing coughed. Then he took out a storage bag from his sleeve (从怀里拿出) and threw it to him, "There are not many magic herbs inside. These are all that I have collected at present. As per your instructions, there are seeds, seedlings and mature ones, but the mature ones number the least."

source: 莫景如今已经没有大碍，他们要找的灵草已经收集了一些，不过因为时间紧迫，所以不是很多。
en_us: As of right now, there wasn't much hindering Mo Jing. He had already gathered some of the magic herbs that they were looking for, but because he had been pressed for time, there weren't very many.

source: 莫景将它转手给游小默，小乌龟也没有半分不适应，被游小默捧在手上，时而动如脱兔，时而静如磐石，作为一只乌龟真不容易。
en_us: Mo Jing passed it to You XiaoMo. The little tortoise could not adapt for half a minute (小乌龟也没有半分不适应). It would occasionally be swung around like a startled rabbit and occasionally be left as still as a boulder while being cupped in You XiaoMo's hands. Life as a tortoise was really not easy.

source: 莫景就算身受重伤也不可能一直待在刍云山脉那个危险的地方，谁知道邢七他们会不会再找过来，留在那里只有找死。
en_us: It was impossible for Mo Jing to remain at such a dangerous place like the ChuYun Mountain Range even if he was seriously injured. Who knew whether Xing Qi and the rest would come looking for him again? Staying there was just like courting death.

source: 莫景思索着说道：“等城门开的话，刑七三人一定会亲自过来把守，发现可疑人物一定会动手，虽说以凌兄的实力不需要在意他们，但是不能保证他们没有其他帮手，对我们来说是一大麻烦。”
en_us: Mo Jing said contemplatively, "If we wait for the gates to open, then Xing Qi and the other two will definitely go to guard the gates personally and act if they see anyone suspicious. Though with Brother Ling's strength there's no need for worry, we can't be certain that they won't have other helpers. That would be very troublesome if it's the case."

source: 莫景扭了扭被踹到的老腰，呲牙说道：“你可以试着被踹一下试试，我保证那滋味会让你一生难忘。”
en_us: Mo Jing rubbed his old waist which had been kicked and grimaced, "You can try being kicked suddenly. I'm sure it'll be memorable enough for a lifetime."

source: 莫景抓了抓头，他的本体是灵龟，所以其实不大会说话，特别是越急，他就越解释不清。
en_us: Mo Jing scratched his head. His original body was that of a spiritual turtle (灵龟), so he didn't actually really know how to talk very well, and especially the more anxious he became, the less he was able to explain things clearly.

source: 莫景捧起他的小主人，“我想请二位帮我把小主人送回玄龟族。”
en_us: Mo Jing held up his Young Master. "I would like to ask you two gentlemen to help me send the Young Master back to the Black Turtle Clan."

source: 莫景握紧手上的灵丹，望着二人离开的方向久久没有移开视线，“希望我没有看错人吧。”
en_us: Mo Jing gripped the magic pill in his hand tightly, and gazed in the direction the two of them had left for a long time without looking away. "I hope I haven't misread them."

source: 莫景摆摆手，走到桌边坐下，“邢七和高殷已经追过来，他们似乎和自然城的黑熊有过交情，就在我要出城的时候，黑熊便下令将城门封锁起来，所以我在这里已经被困了快七天了。”
en_us: Mo Jing waved his hand and walked over to the table to sit, "Xing Qi and Gao Yan (高殷 to rara: Gao Yin or Gao Yan?) have been chasing after me. They seem to have some friendly relations with Hei Xiong from ZiRan City. Hei Xiong ordered the city gates to be sealed up just as I was about to leave the city, so I've alreadly been trapped here for almost seven days."

source: 莫景摸摸小乌龟的龟壳，他已经稍微对他们放下戒心，因为一般人在得知小主人是通灵玄龟后，第一时间应该是冲过来抢，也不是像游小默一样问东问西，一副十分好奇的表情。
en_us: Mo Jing rubbed Baby Turtle's shell. He had already slightly lowered his guard around them, since most people after hearing that the Young Master was a Psychic Black Turtle would have immediately rushed over to snatch him. They wouldn't ask questions like You XiaoMo with an extremely curious expression.

source: 莫景有看到凌霄将邢七一只手臂卸下来的动作。
en_us: Mo Jing had also seen how Ling Xiao had ripped off Xing Qi's arm with one move.

source: 莫景欣喜万分，肯接过牌子就代表他答应自己的请求。
en_us: Mo Jing was extremely happy. If he agreed to take the card, that meant he had agreed to the request.

source: 莫景没有从他眼中看到贪婪，迟疑的点下头。
en_us: Mo Jing didn't see any greed in his eyes, and nodded his head slowly.

source: 莫景没有停留，身影迅疾的往城外飞去。
en_us: Without stopping, Mo Jing's sillouttee swifty flew towards the gate.

source: 莫景深有同感，正要应景的说句话，然后就听到他第二句话。
en_us: Mo Jing fully agreed and was about to give an appropriate follow-up (正要应景的说句话) when he heard You XiaoMo's second sentence.

source: 莫景点点头，“是的，其实我也不愿意相信有族人会背叛龟族，但事实胜于雄辩，因为知道我把小主人送回玄龟族的人不超过五人。”
en_us: Mo Jing nodded. "Yes. Actually, I don't want to suspect that a clan member would betray the Black Turtle Clan either, but facts speak louder than words, because no more than five people know that I sent the Young Master back to the Black Turtle Clan."

source: 莫景点点头，看到他们出现在自然城，他就已经猜到了，心里同时松了一口气，任务总算完成了。
en_us: Mo Jing nodded. He had guessed as such when he saw them appear in ZiRan City and at the same time, he breathed a sigh of relief. His task was finally completed.

source: 莫景突然有种对方其实就在等他这句话的感觉，旋即苦笑道：“二位恩公也知道以我现在的情况，若不及时疗伤是找不到玄龟族的，但我家小主人情况特殊，所以我想请二位恩公帮个忙”
en_us: Mo Jing suddenly felt as if the other party had been waiting for this sentence of his all along, and he immediately laughed wryly. "You two gentlemen (二位恩公//idk how to translate this appropriately lol) already know my situation right now. If I do not treat my wounds soon, I won't be able to find the Black Turtle Clan. But my Young Master's situation is unique, so I would like to ask you two gentlemen to do me a favor."

source: 莫景脸上露出一丝尴尬，“我、我相信两位恩公。”
en_us: Mo Jing's face revealed a bit of unease. "I, I trust you two gentlemen."

source: 莫景被他谢得一脸尴尬，其实也没多辛苦。
en_us: Mo Jing was embarrassed by his thanks, actually it also was not too much trouble.

source: 莫景轻轻松松就挡了下来。
en_us: Mo Jing blocked with ease.

source: 莫菲再迟钝也感觉到她们的杀气，不过他大概是觉得两名女侍不敢真的杀她们，所以并未露出丝毫害怕的神情。
en_us: No matter how thick-skulled Mo Fei was, this was killing intent thick enough for even her to sense. However, she probably thought that the two attendants didn't actually dare kill them and thus wasn't afraid at all.

source: 莫菲却以为牛徐阳被她说中痛处，不依不饶的讽刺他，丝毫没注意到谢俊的脸色，直到莫雪开口斥责。
en_us: Mo Fei thought that she had struck Niu XuYang's nerve and continued to mock him. She didn't notice Xie Jun's expression at all until Mo Xue spoke up and scolded her.

source: 莫菲反驳不了，却不甘的吼道：“你补是古玛部落的圣女吗，你的实力不是很高吗，为什么补杀了他以绝后患，难道你是故意要放过他们，你对古玛部落到底存在什么心？”
en_us: Mo Fei could not refute, yet she was not willing to take it lying down as she shouted, "Aren't you the holy maiden of the Guma Tribe? Isn't your strength very high? Why didn't you kill him and spare all later trouble? Don't tell me you deliberately let them go. What kind of intention do you have for the Guma Tribe in the end?"

source: 莫菲完全没看到谢俊的脸上，听到牛徐阳有贬低她的谢大哥的意思，立刻反驳道：“牛徐阳，你不要胡说，你自己实力弱，不要以为人人都跟你一样。”
en_us: Mo Fei wasn't looking at Xie Jun's face and, hearing Niu XuYang demeaning her Xie Dage, immediately retorted, "Niu XuYang, don't talk nonsense. You're weak; don't go around thinking everyone is weak like you."

source: 莫菲怒道：“你们不要命了是吗，竟然敢违背圣女的命令，要是被我爹知道了，我一定会让我爹治圣女的罪。”
en_us: Mo Fei cried out in anger, "Do you want to die? You dare to go against the holy maiden's orders? My father will know about this! I'll make sure he punishes her!"

source: 莫菲想跟上去，但是她害怕跟她姐姐遭遇同样的下场，只好粘着牛徐阳，让他挡住游小默的视线，这样就算有问题也是牛徐阳先遭殃。
en_us: Mo Fei wanted to follow him but she was afraid of becoming like her sister, so she just glued herself to Niu XuYang. Using him to block You XiaoMo's vision so that even if something happened, it would happen to Niu XuYang first.

source: 莫菲正要反驳，突然看到谢俊的表情，不知怎么的，她好像明白什么了，立刻吓得闭嘴了，末了还不忘瞪牛徐阳一眼。
en_us: Mo Fei was about to retort, but she suddenly saw Xie Jun's expression and seemed to understand something, going silent in fear, but not forgetting to shoot Niu XuYang a glare.

source: 莫菲没有立刻指向新移民和凌霄的方向，而是将她拉到莫雪和谢俊那边，一副告状的口吻道：“夏姐姐，你快帮姐姐看看，她被人家毁容了。”
en_us: Mo Fei didn't instantly point in the direction of the new immigrants and Ling Xiao. Instead, she pulled her over to Mo Xue and Xie Jun and said in a complaining tone, "Sister Xia, hurry and take a look at my older sister. She was disfigured by someone."

source: 莫菲涛涛不绝地说完后，一脸期待的看着白衣女人，“夏姐姐，姐姐她好可怜，你一定要替她做主。”
en_us: After Mo Fei finished pouring out the story, she looked expectantly at the woman in white. "Sister Xia, my big sister is so pitiful. You must back her up."

source: 莫菲的情况比莫雪更惨，她的实力本就比莫雪差，一下子就被擒住了，两个强盗淫笑着对她上下其手，小姑娘吓得眼泪都快掉下来了，不停的喊姐姐救她。
en_us: Mo Fei was in even more dire straits than Mo Xue. In the first place, her strength was worse than Mo Xue's, and she was seized at once. The two bandits leered at her as they manipulated her, and the young woman was so scared that she almost started crying, continuously shouting for her sister to come rescue her.

source: 莫菲的话她只信了一成，其余的全都不信，因为若是不是他们挑衅对方，很少有人会无缘无故动手。
en_us: She believed only ten percent of Mo Fei's words, and did not believe the rest because few would have made a move for no reason if they had not provoked the other.

source: 莫菲立刻指着角落里的游小默和凌霄，脸上带着快意的表情，憋屈那么久，他们终于可以报仇了。
en_us: Mo Fei instantly pointed at You XiaoMo and Ling Xiao in the corner, a pleased expression on her face. After oppressing it for so long, they could finally get revenge.

source: 莫菲终于找到宣泄口，将游小默和凌霄的罪行添油加醋的说了一遍，她的声音不小，当着游小默他们的面将很多事实都夸大了，比如她没说是因为莫雪先出言不逊在先，也没有说游小默曾经救过莫雪，反正一切都是游小默的错。
en_us: Mo Fei finally found a way to vent, and she colorfully described all of You XiaoMo and Ling Xiao's offences. Her voice wasn't quiet, and she greatly exaggerated many things right in front of You XiaoMo's face. For example, she didn't include that it was because back then Mo Xue had spoken insolently first, nor did she include that You XiaoMo had once rescued Mo Xue. In any case, it was all You XiaoMo's fault.

source: 莫菲被他第一句气得脸颊都红了，听到后面的话才恶狠狠的说道：“听好了，本姑娘就是古玛部落的二小姐莫菲，伟大的莫玛部长就是我爹。”
en_us: Mo Fei's face turned red from anger after his first sentence. When she heard what he said after that, she said viciously, "Listen well. I am the Guma Tribe's second young mistress Mo Fei (二小姐莫菲), and the great Guma Minister (莫玛部长) is my dad."

source: 莫菲见姐姐启动法宝，急急忙忙跑过去，小秋立刻将她拦下来，趁她心慌意乱的时候刺伤了她。
en_us: Seeing her older sister activate the magic tool, Mo Fei hurried over, but was blocked by Xiao Qiu who managed to stab her thanks to this distraction.

source: 莫雪一看他长得很英俊，很对她的胃口，腿一软就倒在他怀里。
en_us: Mo Xue saw that Xie Jun was very handsome and since his looks were to her liking, she fell into his arms when her legs went soft.
